

# s = 96
# a = 7
# x = s // a
# print("您能买",x,"个西瓜")
# f = s % a
# print("找零",f,"元")




# l = 10000 * ((1 + 0.2) ** 10)

# print(l)


# print("*" * 7)

# print("*" + 5 * " " + "*")
# print("*" + 5 * " " + "*")

# print("*" * 7)



# r = 3
# l = 2 * r * 3.14
# s = r ** 2 * 3.14
# print("周长为",l,"面积为",s)



print("   *   ")
print("  ***  ")
print(" ***** ")
print("*******")


a = 16
s = 216 // a
l = 216 % a
print(s, "斤", l, "两")


a = 63320
s = a // 3600
l = a % 3600 // 60
m = a % 3600 % 60



print("现在是", s, "时", l, "分", m, "秒")



s = 5.0/9.0 * (100 - 32)
a = 273.15 + s
print("100华氏温度转为摄氏温度和开氏温度分别是", s, a, "度")











